app/controllers/agencies_controller.rb

SELECT "agencies".* FROM "agencies"
---
  def index
    agencies = Agency.all

INSERT INTO "agencies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Dudu agency"], ["created_at", "2022-06-29 15:42:58.392113"], ["updated_at", "2022-06-29 15:42:58.392113"]]
INSERT INTO "costs" ("agency_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["agency_id", "0fab1d1f-640e-451a-a18d-f7386a3c46e6"], ["amount", 500], ["created_at", "2022-06-29 15:43:51.426881"], ["updated_at", "2022-06-29 15:43:51.426881"]]
---
  def create
    agency = Agency.create(name: create_agency_params[:name])
    agency_cost = Cost.create(agency_id: agency.id, amount: create_agency_params[:cost])

SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]
---
  def transfer
    agency = Agency.find(transfer_params[:agency_id])

SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]
---
  def agency
    Agency.find(agency_params[:id])