app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    users = User.all

INSERT INTO "users" ("name", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jean"], ["number", "0102030405"], ["created_at", "2022-06-29 14:59:35.799413"], ["updated_at", "2022-06-29 14:59:35.799413"]]
---
  def create
    user = User.new(create_user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0102030405"], ["LIMIT", 1]]
---
  def deposit
    user = User.find_by(number: deposit_params[:number])

SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0102030405"], ["LIMIT", 1]]
---
  def transfer
    agency = Agency.find(transfer_params[:agency_id])
    sender = User.find_by(number: transfer_params[:sender])

SELECT "agency_transactions".* FROM "agency_transactions" WHERE "agency_transactions"."agency_id" = $1 AND "agency_transactions"."code" = $2 LIMIT $3  [["agency_id", "e6222b53-8c92-49ed-93e2-e4fbc844a18f"], ["code", "8585"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0504030201"], ["LIMIT", 1]]
---
  def withdraw
    agency_id = withdraw_params[:agency_id]
    code = withdraw_params[:code]
    agency_trs = AgencyTransaction.find_by(agency_id: agency_id, code: code)
    receiver_number = agency_trs.receiver
    receiver = User.find_by(number: receiver_number)

SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0102030405"], ["LIMIT", 1]]
---
  def user
    user = User.find_by(number: user_number_params[:number])

SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0102030405"], ["LIMIT", 1]]
---
  def set_user_by_number
    User.find_by(number: params[:number])