app/models/agency.rb

  def transfer(agency_id, sender_number, receiver_number, amount)
    agency = Agency.find(agency_id)
    sender = User.find_by(number: sender_number)
    receiver = User.find_by(number: receiver_number)
    code = generate_code
    # raise code.inspect
    ActiveRecord::Base.transaction do
      # Create a transaction (-) for sender
      sender.user_transactions.create!(
        type_of: "transfer",
        user_id: sender.id,
        receiver_id: receiver.id,
        amount: -amount,
        code: code
      )
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0102030405"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."number" = $1 LIMIT $2  [["number", "0770077007"], ["LIMIT", 1]]
INSERT INTO "user_transactions" ("user_id", "type_of", "receiver_id", "amount", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def agency_cost(agency_id)
    agency = Agency.find(agency_id)
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]