app/models/user.rb

  def deposit(amount)
    # raise amount.inspect
    user_transactions.create!(type_of: "deposit", amount: amount.to_i, user_id: self.id)
---
INSERT INTO "user_transactions" ("user_id", "type_of", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "9c984312-37ee-4cc2-9933-520a4790eb07"], ["type_of", "deposit"], ["amount", 15000], ["created_at", "2022-06-30 18:13:10.422493"], ["updated_at", "2022-06-30 18:13:10.422493"]]

  def transfer(agency_id, receiver_number, amount)
    agency = Agency.find(agency_id)
    # receiver = User.find_by(number: receiver)
    code = generate_code

    ActiveRecord::Base.transaction do
      user_transactions.create!(
        type_of: "transfer",
        user_id: self.id,
        receiver: receiver_number,
        amount: -amount,
        code: code
      )
      #raise self.inspect
      agency.agency_transactions.create!(
        agency_id: agency_id,
        type_of: "transfer",
        sender: self.number,
        receiver: receiver_number,
        amount: amount_after_agency_cost(amount, agency_id),
        fee: agency_cost(agency_id),
        code: code
      )
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "1e46709a-680f-4f8f-bd2d-db73f934e3b0"], ["LIMIT", 1]]
INSERT INTO "user_transactions" ("user_id", "type_of", "receiver_id", "amount", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "agency_transactions" ("agency_id", "type_of", "sender", "receiver", "amount", "fee", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def withdraw(agency_id, code)
    agency = Agency.find(agency_id)
    agency_trs = AgencyTransaction.find_by(agency_id: agency_id, code: code)
    ActiveRecord::Base.transaction do
      user_transactions.create!(
        type_of: "withdraw",
        user_id: self.id,
        amount: agency_trs.amount,
        code: code
      )
      #raise self.inspect
      agency.agency_transactions.create!(
        agency_id: agency_id,
        type_of: "withdraw",
        receiver: self.number,
        amount: -agency_trs.amount,
      )
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "6462c5ab-dd0b-418d-8686-c6a524af0376"], ["LIMIT", 1]]
SELECT "agency_transactions".* FROM "agency_transactions" WHERE "agency_transactions"."agency_id" = $1 AND "agency_transactions"."code" = $2 LIMIT $3  [["agency_id", "6462c5ab-dd0b-418d-8686-c6a524af0376"], ["code", "7522"], ["LIMIT", 1]]
INSERT INTO "user_transactions" ("user_id", "type_of", "amount", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "agency_transactions" ("agency_id", "type_of", "receiver", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def agency_cost(agency_id)
    agency = Agency.find(agency_id)
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = $1 LIMIT $2  [["id", "e6222b53-8c92-49ed-93e2-e4fbc844a18f"], ["LIMIT", 1]]